rolfz/stc1000p/src/page0.c
		// Clear interrupt flag
		PIR1bits.TMR2IF = 0;
	}
    
} // end ISR



#ifdef USE_NTC
#define _ADON 1
#define _CHS0 2
#define _CHS1 4

#define START_TCONV_1()		(ADCON0 = _CHS0 | _ADON)
#define START_TCONV_2()		(ADCON0 = _CHS1 | _ADON)

unsigned int read_ad(unsigned int adfilter){
    unsigned int tmp;
    
	ADCON0bits.GO = 1;
	while(ADCON0bits.GO);
	ADCON0bits.ADON = 0;

    tmp=((ADRESH *256) + ADRESL); // original code adding high byte did not work with C18 compiler
                                  // took me a long time to find out what was wrong with this code

    // low pass with last 63 values
    return ((adfilter-(adfilter>>6)) + tmp);
}



/******************************************************************************/
int ad_to_temp(unsigned int adfilter){
	unsigned char i;
    long temp = 32;
	unsigned char a = ((adfilter >> 5) & 0x3f); // Lower 6 bits
	unsigned char b = ((adfilter >> 11) & 0x1f); // Upper 5 bits

	// Interpolate between lookup table points
    
    // Table is 32 words long = 64 bytes
	for (i = 0; i < SAMPLES; i++) {
		if(a <= i) {
			temp += ad_lookup[b];
		} else {
			temp += ad_lookup[b + 1];
		}
	}

	// Divide by 64 to get back to normal temperature
	return (temp >> 6);
}
#endif


#if defined COM
enum com_states {
	com_idle = 0,
	com_recv_addr,
	com_recv_data1,
	com_recv_data2,
	com_recv_checksum,
	com_trans_data1,
	com_trans_data2,
	com_trans_checksum,
	com_trans_ack
};

/* State machine to handle rx/tx protocol */
static void handle_com(unsigned const char rxdata){
	static unsigned char command;
	static unsigned char xorsum;
	static unsigned int data;
	static unsigned char addr;

	xorsum ^= rxdata;

	com_write = 0;

	if(com_state == com_idle){
		command = rxdata;
		xorsum = rxdata;
		addr = 0;
		if(command == COM_READ_EEPROM || command == COM_WRITE_EEPROM){
			com_state = com_recv_addr;
		} else if(rxdata == COM_READ_TEMP){
			data = temperature;
			com_state = com_trans_data1;
		} else if(rxdata == COM_READ_COOLING){
			data = REL_COOL;
			com_state = com_trans_data1;
		} else if(rxdata == COM_READ_HEATING){
			data = REL_HEAT;
			com_state = com_trans_data1;
		}
	} else if(com_state == com_recv_addr){
		addr = rxdata;
		if(command == COM_WRITE_EEPROM){
			com_state = com_recv_data1;
		} else {
			data = (unsigned int)eeprom_read_config(addr);
			com_state = com_trans_data1;
		}			
	} else if(com_state == com_recv_data1 || com_state == com_recv_data2){
		data = (data << 8) | rxdata;
		com_state++;
	} else if(com_state == com_recv_checksum){
		if(xorsum == 0){
			eeprom_write_config(addr, (int)data);
			com_data = COM_ACK;
		} else {
			com_data = COM_NACK;
		}
		com_write = 1;
		com_state = com_idle;
	} else if(com_state == com_trans_data2){
		com_data = (unsigned char) data; 
		com_write = 1;
		com_state = com_trans_checksum;
	} else if(com_state == com_trans_checksum){
		com_data = command ^ addr ^ ((unsigned char)(data >> 8)) ^ ((unsigned char) data);
		com_write = 1;
		com_state = com_trans_ack;
	} else if(com_state == com_trans_ack){
		com_data = COM_ACK;
		com_write = 1;
		com_state = com_idle;
	}

	if(com_state == com_trans_data1 || com_state == com_trans_data2){
		com_data = (data >> 8);
		com_write = 1;
		com_state++;
	}

}

#elif defined FO433

enum fo433_states {
	fo433_preamble=0,
	fo433_devid_high,
	fo433_devid_low_temp_high,
	fo433_temp_low,
	fo433_humidity,
	fo433_crc
};

/* Fine offset state machine */
static void fo433_fsm(){
	static int t;
	static unsigned char crc;

	if(fo433_state == fo433_preamble){
		fo433_data = 0xff;
	} else if(fo433_state == fo433_devid_high){
		fo433_data = 0x45;
		crc = 0;
	} else if(fo433_state == fo433_devid_low_temp_high){
		unsigned char di = ((unsigned char)eeprom_read_config(EEADR_SET_MENU_ITEM(hy2))) << 4;
		t = temperature;
		fo433_data = (di | ((t >> 8) & 0xf));
	} else if(fo433_state == fo433_temp_low){
		fo433_data = (unsigned char) t;
	} else if(fo433_state == fo433_humidity){
		fo433_data = (REL_HEAT << 6) | (REL_COOL << 4);
	} else if(fo433_state == fo433_crc){
		fo433_data = crc;
	}

	// Calc CRC
	{
		unsigned char i=8;
		unsigned char d = fo433_data;
		while(i-- > 0){
			unsigned char mix = (crc ^ d) & 0x80;
			crc <<= 1;
			if(mix){
				crc ^= 0x31;
			}
			d <<= 1;
		}
	}

	fo433_count = 0x80;

	/* Enable timer 0 */
	TMR0IE = 1;
	TMR0CS = 0;
}

#endif

#ifdef USE_NTC 
    unsigned int ad_filter=0x7fff;
#else
    unsigned int temp_raw;
#endif
//    unsigned char div2=0;
unsigned int millisx60=0;
/******************************************************************************
 * Main entry point.
 */
    
void main(void)  {
    
//  static unsigned int millisx60=0;
//	static unsigned int ad_filter=0x7ffe; 
//	static unsigned int ad_filter;
    
#if defined PB2
	unsigned int ad_filter2=0x7ffe;
#endif

	init();

#ifdef USE_NTC
 	START_TCONV_1();   
#endif



#ifdef TEST_1DIGIT
    while(1){
				led_e.e_negative = 1;
				led_10.raw = LED_OFF;
				led_1.raw = led_01.raw = LED_OFF;
    }
#endif
	//Loop forever
	while (1) {

#if defined COM
		/* Handle communication if full byte transmitted/received */
		GIE = 0;
		if(com_count >= 8){
			char rxdata = com_data;
			com_count = 0;
			GIE = 1;
 			handle_com(rxdata);
		}
		GIE = 1;
#elif defined FO433
		/* Send next byte */
		if((fo433_state <= fo433_crc) && (fo433_count == 0)){
			fo433_fsm();
			fo433_state++;
		}
#endif
          
        
		// Handle button press and menu
		if(tmr6if) { 

			button_menu_fsm();

			if(!tmr4on){
				led_e.raw = LED_OFF;
				led_10.raw = LED_O;
				led_1.raw = led_01.raw = LED_F;
			}

			// Reset timer flag
			tmr6if = 0;
		}

        // read sensors and convert 
#ifndef USE_TIMER1
		if(tmr4if) { // run every 60ms

			millisx60++; 

			if(millisx60 & 0x1){ // every 120ms we read the temp value
#if defined USE_NTC
				ad_filter = read_ad(ad_filter); 
                
#elif defined (USE_DS1820)
                temp_raw = ds1820_read_raw();
#endif
#if defined PB2
				START_TCONV_2();
			} else {
				ad_filter2 = read_ad(ad_filter2);
#endif
#if defined USE_NTC
				START_TCONV_1();
#endif
			}
			// Only run every 16th time called, that is 16x60ms = 960ms
			// Close enough to 1s for our purposes.
			if((millisx60 & 0xf) == 0) {
#else
                
                if(tmr4if)
                {
                millisx60+=16;
                    // 1 second done directly without any filter.
                
                temp_raw = ds1820_read_raw();

                if((div2++ ==4)==0)
                {
                div2=0;
#endif  
                
#if defined USE_NTC
				temperature = ad_to_temp(ad_filter) + eeprom_read_config(EEADR_SET_MENU_ITEM(tc));
#elif defined USE_DS1820
              //  temp_raw=0x07d8; //+125.5
              //  temp_raw=0x0198; // +25.5
              //  temp_raw=0xfe68; // -25.5
              //  temp_raw=0xfc98; // -55.5
              //  temp_raw=0x0008; // +0.5
               //   temp_raw=0xff38; // -0.5
                // ad_filter contains raw data from DS1820 sensor
                // the 4 lower bits are < 1deg, need to be converted
                // we only use 0.5deg précision from the sensor.
                // no need to calibrate a
				temperature = (int)temp_raw/16;
                temperature*=10;
                if(temp_raw&0x08){
                    temperature+=5;
                    }
#endif
#if defined PB2
				temperature2 = ad_to_temp(ad_filter2) + eeprom_read_config(EEADR_SET_MENU_ITEM(tc2));
#endif

#if defined FO433
				if(fo433_sec_count < 3){
					fo433_state = 0;
				}
				if(fo433_sec_count == 0){
					fo433_sec_count = 48;
				}
				fo433_sec_count--;
			
#endif

				// Alarm on sensor error (AD result out of range)
#if defined USE_NTC
				BUZ = ((ad_filter>>8) >= 248 || (ad_filter>>8) <= 8) 
#else
                if(!ds1820_exist())BUZ=1;
                else BUZ=0;
                   
#endif

#if defined PB2
					 (eeprom_read_config(EEADR_SET_MENU_ITEM(Pb)) && ((ad_filter2>>8) >= 248 || (ad_filter2>>8) <= 8))
#endif
				;

				if(BUZ){ // On alarm, disable outputs
					led_10.raw = LED_A;
					led_1.raw = LED_L;
					led_e.raw = led_01.raw = LED_OFF;
					REL_COOL = 0;
					REL_HEAT = 0;
					cooling_delay = heating_delay = 60;
				} else {
					// Update running profile every hour (if there is one)
					// and handle reset of millis x60 counter
					if(((unsigned char)eeprom_read_config(EEADR_SET_MENU_ITEM(rn))) < THERMOSTAT_MODE){
						// Indicate profile mode
						led_e.e_set = 0;
						// Update profile every hour
						if(millisx60 >= 60000){
							update_profile();
							millisx60 = 0;
						}
					} else {
						led_e.e_set = 1;
						millisx60 = 0;
					}

					{
						int sa = eeprom_read_config(EEADR_SET_MENU_ITEM(SA));
						if(sa){
							int diff = temperature - eeprom_read_config(EEADR_SET_MENU_ITEM(SP));
							if(diff < 0){
								diff = -diff;
							} 
							if(sa < 0){
								sa = -sa;
								BUZ = diff <= sa;
							} else {
								BUZ = diff >= sa;
							}
						}
					}

					// Run thermostat
					temperature_control();

					// Show temperature if menu is idle
					if(dispTemp){ // was TMR1GE
						if(BUZ && alarmFlash){ //RX9 ){ 
							led_10.raw = LED_S;
							led_1.raw = LED_A;
							led_01.raw = LED_OFF;
						} else {
#if defined PB2
							led_e.e_point = !memu01; // was TX9
							if(menu01){ // was TX9
								temperature_to_led(temperature2);
							} else {
								temperature_to_led(temperature);
							}
#else
							temperature_to_led(temperature);
#endif
						}
                        alarmFlash!=alarmFlash; // was RX9
					}
				}
			} // End 1 sec section
            
        	// Reset timer flag
			tmr4if = 0;
		}
		// Reset watchdog
		ClrWdt();
	} // end while(1)
} // end main

